will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/*
 * Autogenerated file
 * Copyright (c) 2026 BFLB Pinctrl Generator <nandojve@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef DT_BINDINGS_PINCTRL_BFLB_BL808CX_PINCTRL_H_
#define DT_BINDINGS_PINCTRL_BFLB_BL808CX_PINCTRL_H_

#include <dt-bindings/pinctrl/bl808x-pinctrl.h>
#include <dt-bindings/pinctrl/bflb-common-pinctrl.h>

/* gpio0_sdh_clk */
#define GPIO0_SDH_CLK \
	BFLB_PINMUX(0, sdh, clk, periph)

/* gpio0_spi0_ss */
#define GPIO0_SPI0_SS \
	BFLB_PINMUX(0, spi0, ss, periph)

/* gpio0_i2s_bclk */
#define GPIO0_I2S_BCLK \
	BFLB_PINMUX(0, i2s, bclk, periph)

/* gpio0_pdm_clk */
#define GPIO0_PDM_CLK \
	BFLB_PINMUX(0, pdm, clk, periph)

/* gpio0_i2c0_scl */
#define GPIO0_I2C0_SCL \
	BFLB_PINMUX(0, i2c0, scl, periph)

/* gpio0_i2c1_scl */
#define GPIO0_I2C1_SCL \
	BFLB_PINMUX(0, i2c1, scl, periph)

/* gpio0_uart0_rts */
#define GPIO0_UART0_RTS \
	BFLB_PINMUX(0, uart0, rts, periph)

/* gpio0_uart0_cts */
#define GPIO0_UART0_CTS \
	BFLB_PINMUX(0, uart0, cts, periph)

/* gpio0_uart0_tx */
#define GPIO0_UART0_TX \
	BFLB_PINMUX(0, uart0, tx, periph)

/* gpio0_uart0_rx */
#define GPIO0_UART0_RX \
	BFLB_PINMUX(0, uart0, rx, periph)

/* gpio0_uart1_rts */
#define GPIO0_UART1_RTS \
	BFLB_PINMUX(0, uart1, rts, periph)

/* gpio0_uart1_cts */
#define GPIO0_UART1_CTS \
	BFLB_PINMUX(0, uart1, cts, periph)

/* gpio0_uart1_tx */
#define GPIO0_UART1_TX \
	BFLB_PINMUX(0, uart1, tx, periph)

/* gpio0_uart1_rx */
#define GPIO0_UART1_RX \
	BFLB_PINMUX(0, uart1, rx, periph)

/* gpio0_uart2_rts */
#define GPIO0_UART2_RTS \
	BFLB_PINMUX(0, uart2, rts, periph)

/* gpio0_uart2_cts */
#define GPIO0_UART2_CTS \
	BFLB_PINMUX(0, uart2, cts, periph)

/* gpio0_uart2_tx */
#define GPIO0_UART2_TX \
	BFLB_PINMUX(0, uart2, tx, periph)

/* gpio0_uart2_rx */
#define GPIO0_UART2_RX \
	BFLB_PINMUX(0, uart2, rx, periph)

/* gpio0_cam1_vsync */
#define GPIO0_CAM1_VSYNC \
	BFLB_PINMUX(0, cam1, vsync, periph)

/* gpio0_pwm0_ch0p */
#define GPIO0_PWM0_CH0P \
	BFLB_PINMUX(0, pwm0, ch0p, periph)

/* gpio0_pwm1_ch0p */
#define GPIO0_PWM1_CH0P \
	BFLB_PINMUX(0, pwm1, ch0p, periph)

/* gpio0_spi1_ss */
#define GPIO0_SPI1_SS \
	BFLB_PINMUX(0, spi1, ss, periph)

/* gpio0_i2c2_scl */
#define GPIO0_I2C2_SCL \
	BFLB_PINMUX(0, i2c2, scl, periph)

/* gpio0_i2c3_scl */
#define GPIO0_I2C3_SCL \
	BFLB_PINMUX(0, i2c3, scl, periph)

/* gpio0_jtag_lp_tms */
#define GPIO0_JTAG_LP_TMS \
	BFLB_PINMUX(0, jtag_lp, tms, periph)

/* gpio0_jtag_m0_tms */
#define GPIO0_JTAG_M0_TMS \
	BFLB_PINMUX(0, jtag_m0, tms, periph)

/* gpio0_jtag_d0_tms */
#define GPIO0_JTAG_D0_TMS \
	BFLB_PINMUX(0, jtag_d0, tms, periph)

/* gpio1_sdh_cmd */
#define GPIO1_SDH_CMD \
	BFLB_PINMUX(1, sdh, cmd, periph)

/* gpio1_spi0_sclk */
#define GPIO1_SPI0_SCLK \
	BFLB_PINMUX(1, spi0, sclk, periph)

/* gpio1_i2s_fs */
#define GPIO1_I2S_FS \
	BFLB_PINMUX(1, i2s, fs, periph)

/* gpio1_pdm_in */
#define GPIO1_PDM_IN \
	BFLB_PINMUX(1, pdm, in, periph)

/* gpio1_i2c0_sda */
#define GPIO1_I2C0_SDA \
	BFLB_PINMUX(1, i2c0, sda, periph)

/* gpio1_i2c1_sda */
#define GPIO1_I2C1_SDA \
	BFLB_PINMUX(1, i2c1, sda, periph)

/* gpio1_uart0_rts */
#define GPIO1_UART0_RTS \
	BFLB_PINMUX(1, uart0, rts, periph)

/* gpio1_uart0_cts */
#define GPIO1_UART0_CTS \
	BFLB_PINMUX(1, uart0, cts, periph)

/* gpio1_uart0_tx */
#define GPIO1_UART0_TX \
	BFLB_PINMUX(1, uart0, tx, periph)

/* gpio1_uart0_rx */
#define GPIO1_UART0_RX \
	BFLB_PINMUX(1, uart0, rx, periph)

/* gpio1_uart1_rts */
#define GPIO1_UART1_RTS \
	BFLB_PINMUX(1, uart1, rts, periph)

/* gpio1_uart1_cts */
#define GPIO1_UART1_CTS \
	BFLB_PINMUX(1, uart1, cts, periph)

/* gpio1_uart1_tx */
#define GPIO1_UART1_TX \
	BFLB_PINMUX(1, uart1, tx, periph)

/* gpio1_uart1_rx */
#define GPIO1_UART1_RX \
	BFLB_PINMUX(1, uart1, rx, periph)

/* gpio1_uart2_rts */
#define GPIO1_UART2_RTS \
	BFLB_PINMUX(1, uart2, rts, periph)

/* gpio1_uart2_cts */
#define GPIO1_UART2_CTS \
	BFLB_PINMUX(1, uart2, cts, periph)

/* gpio1_uart2_tx */
#define GPIO1_UART2_TX \
	BFLB_PINMUX(1, uart2, tx, periph)

/* gpio1_uart2_rx */
#define GPIO1_UART2_RX \
	BFLB_PINMUX(1, uart2, rx, periph)

/* gpio1_cam1_hsync */
#define GPIO1_CAM1_HSYNC \
	BFLB_PINMUX(1, cam1, hsync, periph)

/* gpio1_pwm0_ch1p */
#define GPIO1_PWM0_CH1P \
	BFLB_PINMUX(1, pwm0, ch1p, periph)

/* gpio1_pwm1_ch1p */
#define GPIO1_PWM1_CH1P \
	BFLB_PINMUX(1, pwm1, ch1p, periph)

/* gpio1_spi1_sclk */
#define GPIO1_SPI1_SCLK \
	BFLB_PINMUX(1, spi1, sclk, periph)

/* gpio1_i2c2_sda */
#define GPIO1_I2C2_SDA \
	BFLB_PINMUX(1, i2c2, sda, periph)

/* gpio1_i2c3_sda */
#define GPIO1_I2C3_SDA \
	BFLB_PINMUX(1, i2c3, sda, periph)

/* gpio1_jtag_lp_tck */
#define GPIO1_JTAG_LP_TCK \
	BFLB_PINMUX(1, jtag_lp, tck, periph)

/* gpio1_jtag_m0_tck */
#define GPIO1_JTAG_M0_TCK \
	BFLB_PINMUX(1, jtag_m0, tck, periph)

/* gpio1_jtag_d0_tck */
#define GPIO1_JTAG_D0_TCK \
	BFLB_PINMUX(1, jtag_d0, tck, periph)

/* gpio2_sdh_dat0 */
#define GPIO2_SDH_DAT0 \
	BFLB_PINMUX(2, sdh, dat0, periph)

/* gpio2_spi0_miso */
#define GPIO2_SPI0_MISO \
	BFLB_PINMUX(2, spi0, miso, periph)

/* gpio2_i2s_di */
#define GPIO2_I2S_DI \
	BFLB_PINMUX(2, i2s, di, periph)

/* gpio2_pdm_clk */
#define GPIO2_PDM_CLK \
	BFLB_PINMUX(2, pdm, clk, periph)

/* gpio2_i2c0_scl */
#define GPIO2_I2C0_SCL \
	BFLB_PINMUX(2, i2c0, scl, periph)

/* gpio2_i2c1_scl */
#define GPIO2_I2C1_SCL \
	BFLB_PINMUX(2, i2c1, scl, periph)

/* gpio2_uart0_rts */
#define GPIO2_UART0_RTS \
	BFLB_PINMUX(2, uart0, rts, periph)

/* gpio2_uart0_cts */
#define GPIO2_UART0_CTS \
	BFLB_PINMUX(2, uart0, cts, periph)

/* gpio2_uart0_tx */
#define GPIO2_UART0_TX \
	BFLB_PINMUX(2, uart0, tx, periph)

/* gpio2_uart0_rx */
#define GPIO2_UART0_RX \
	BFLB_PINMUX(2, uart0, rx, periph)

/* gpio2_uart1_rts */
#define GPIO2_UART1_RTS \
	BFLB_PINMUX(2, uart1, rts, periph)

/* gpio2_uart1_cts */
#define GPIO2_UART1_CTS \
	BFLB_PINMUX(2, uart1, cts, periph)

/* gpio2_uart1_tx */
#define GPIO2_UART1_TX \
	BFLB_PINMUX(2, uart1, tx, periph)

/* gpio2_uart1_rx */
#define GPIO2_UART1_RX \
	BFLB_PINMUX(2, uart1, rx, periph)

/* gpio2_uart2_rts */
#define GPIO2_UART2_RTS \
	BFLB_PINMUX(2, uart2, rts, periph)

/* gpio2_uart2_cts */
#define GPIO2_UART2_CTS \
	BFLB_PINMUX(2, uart2, cts, periph)

/* gpio2_uart2_tx */
#define GPIO2_UART2_TX \
	BFLB_PINMUX(2, uart2, tx, periph)

/* gpio2_uart2_rx */
#define GPIO2_UART2_RX \
	BFLB_PINMUX(2, uart2, rx, periph)

/* gpio2_pwm0_ch2p */
#define GPIO2_PWM0_CH2P \
	BFLB_PINMUX(2, pwm0, ch2p, periph)

/* gpio2_pwm1_ch2p */
#define GPIO2_PWM1_CH2P \
	BFLB_PINMUX(2, pwm1, ch2p, periph)

/* gpio2_spi1_miso */
#define GPIO2_SPI1_MISO \
	BFLB_PINMUX(2, spi1, miso, periph)

/* gpio2_i2c2_scl */
#define GPIO2_I2C2_SCL \
	BFLB_PINMUX(2, i2c2, scl, periph)

