will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio2_i2c3_scl */
#define GPIO2_I2C3_SCL \
	BFLB_PINMUX(2, i2c3, scl, periph)

/* gpio2_jtag_lp_tdo */
#define GPIO2_JTAG_LP_TDO \
	BFLB_PINMUX(2, jtag_lp, tdo, periph)

/* gpio2_jtag_m0_tdo */
#define GPIO2_JTAG_M0_TDO \
	BFLB_PINMUX(2, jtag_m0, tdo, periph)

/* gpio2_jtag_d0_tdo */
#define GPIO2_JTAG_D0_TDO \
	BFLB_PINMUX(2, jtag_d0, tdo, periph)

/* gpio3_sdh_dat1 */
#define GPIO3_SDH_DAT1 \
	BFLB_PINMUX(3, sdh, dat1, periph)

/* gpio3_spi0_mosi */
#define GPIO3_SPI0_MOSI \
	BFLB_PINMUX(3, spi0, mosi, periph)

/* gpio3_i2s_do */
#define GPIO3_I2S_DO \
	BFLB_PINMUX(3, i2s, do, periph)

/* gpio3_pdm_in */
#define GPIO3_PDM_IN \
	BFLB_PINMUX(3, pdm, in, periph)

/* gpio3_i2c0_sda */
#define GPIO3_I2C0_SDA \
	BFLB_PINMUX(3, i2c0, sda, periph)

/* gpio3_i2c1_sda */
#define GPIO3_I2C1_SDA \
	BFLB_PINMUX(3, i2c1, sda, periph)

/* gpio3_uart0_rts */
#define GPIO3_UART0_RTS \
	BFLB_PINMUX(3, uart0, rts, periph)

/* gpio3_uart0_cts */
#define GPIO3_UART0_CTS \
	BFLB_PINMUX(3, uart0, cts, periph)

/* gpio3_uart0_tx */
#define GPIO3_UART0_TX \
	BFLB_PINMUX(3, uart0, tx, periph)

/* gpio3_uart0_rx */
#define GPIO3_UART0_RX \
	BFLB_PINMUX(3, uart0, rx, periph)

/* gpio3_uart1_rts */
#define GPIO3_UART1_RTS \
	BFLB_PINMUX(3, uart1, rts, periph)

/* gpio3_uart1_cts */
#define GPIO3_UART1_CTS \
	BFLB_PINMUX(3, uart1, cts, periph)

/* gpio3_uart1_tx */
#define GPIO3_UART1_TX \
	BFLB_PINMUX(3, uart1, tx, periph)

/* gpio3_uart1_rx */
#define GPIO3_UART1_RX \
	BFLB_PINMUX(3, uart1, rx, periph)

/* gpio3_uart2_rts */
#define GPIO3_UART2_RTS \
	BFLB_PINMUX(3, uart2, rts, periph)

/* gpio3_uart2_cts */
#define GPIO3_UART2_CTS \
	BFLB_PINMUX(3, uart2, cts, periph)

/* gpio3_uart2_tx */
#define GPIO3_UART2_TX \
	BFLB_PINMUX(3, uart2, tx, periph)

/* gpio3_uart2_rx */
#define GPIO3_UART2_RX \
	BFLB_PINMUX(3, uart2, rx, periph)

/* gpio3_cam1_dat0 */
#define GPIO3_CAM1_DAT0 \
	BFLB_PINMUX(3, cam1, dat0, periph)

/* gpio3_pwm0_ch3p */
#define GPIO3_PWM0_CH3P \
	BFLB_PINMUX(3, pwm0, ch3p, periph)

/* gpio3_pwm1_ch3p */
#define GPIO3_PWM1_CH3P \
	BFLB_PINMUX(3, pwm1, ch3p, periph)

/* gpio3_spi1_mosi */
#define GPIO3_SPI1_MOSI \
	BFLB_PINMUX(3, spi1, mosi, periph)

/* gpio3_i2c2_sda */
#define GPIO3_I2C2_SDA \
	BFLB_PINMUX(3, i2c2, sda, periph)

/* gpio3_i2c3_sda */
#define GPIO3_I2C3_SDA \
	BFLB_PINMUX(3, i2c3, sda, periph)

/* gpio3_jtag_lp_tdi */
#define GPIO3_JTAG_LP_TDI \
	BFLB_PINMUX(3, jtag_lp, tdi, periph)

/* gpio3_jtag_m0_tdi */
#define GPIO3_JTAG_M0_TDI \
	BFLB_PINMUX(3, jtag_m0, tdi, periph)

/* gpio3_jtag_d0_tdi */
#define GPIO3_JTAG_D0_TDI \
	BFLB_PINMUX(3, jtag_d0, tdi, periph)

/* gpio4_sdh_dat2 */
#define GPIO4_SDH_DAT2 \
	BFLB_PINMUX(4, sdh, dat2, periph)

/* gpio4_spi0_ss */
#define GPIO4_SPI0_SS \
	BFLB_PINMUX(4, spi0, ss, periph)

/* gpio4_flash1_cs */
#define GPIO4_FLASH1_CS \
	BFLB_PINMUX(4, flash1, cs, periph)

/* gpio4_i2s_bclk */
#define GPIO4_I2S_BCLK \
	BFLB_PINMUX(4, i2s, bclk, periph)

/* gpio4_pdm_clk */
#define GPIO4_PDM_CLK \
	BFLB_PINMUX(4, pdm, clk, periph)

/* gpio4_i2c0_scl */
#define GPIO4_I2C0_SCL \
	BFLB_PINMUX(4, i2c0, scl, periph)

/* gpio4_i2c1_scl */
#define GPIO4_I2C1_SCL \
	BFLB_PINMUX(4, i2c1, scl, periph)

/* gpio4_uart0_rts */
#define GPIO4_UART0_RTS \
	BFLB_PINMUX(4, uart0, rts, periph)

/* gpio4_uart0_cts */
#define GPIO4_UART0_CTS \
	BFLB_PINMUX(4, uart0, cts, periph)

/* gpio4_uart0_tx */
#define GPIO4_UART0_TX \
	BFLB_PINMUX(4, uart0, tx, periph)

/* gpio4_uart0_rx */
#define GPIO4_UART0_RX \
	BFLB_PINMUX(4, uart0, rx, periph)

/* gpio4_uart1_rts */
#define GPIO4_UART1_RTS \
	BFLB_PINMUX(4, uart1, rts, periph)

/* gpio4_uart1_cts */
#define GPIO4_UART1_CTS \
	BFLB_PINMUX(4, uart1, cts, periph)

/* gpio4_uart1_tx */
#define GPIO4_UART1_TX \
	BFLB_PINMUX(4, uart1, tx, periph)

/* gpio4_uart1_rx */
#define GPIO4_UART1_RX \
	BFLB_PINMUX(4, uart1, rx, periph)

/* gpio4_uart2_rts */
#define GPIO4_UART2_RTS \
	BFLB_PINMUX(4, uart2, rts, periph)

/* gpio4_uart2_cts */
#define GPIO4_UART2_CTS \
	BFLB_PINMUX(4, uart2, cts, periph)

/* gpio4_uart2_tx */
#define GPIO4_UART2_TX \
	BFLB_PINMUX(4, uart2, tx, periph)

/* gpio4_uart2_rx */
#define GPIO4_UART2_RX \
	BFLB_PINMUX(4, uart2, rx, periph)

/* gpio4_pwm0_ch0p */
#define GPIO4_PWM0_CH0P \
	BFLB_PINMUX(4, pwm0, ch0p, periph)

/* gpio4_pwm1_ch0p */
#define GPIO4_PWM1_CH0P \
	BFLB_PINMUX(4, pwm1, ch0p, periph)

/* gpio4_spi1_ss */
#define GPIO4_SPI1_SS \
	BFLB_PINMUX(4, spi1, ss, periph)

/* gpio4_i2c2_scl */
#define GPIO4_I2C2_SCL \
	BFLB_PINMUX(4, i2c2, scl, periph)

/* gpio4_i2c3_scl */
#define GPIO4_I2C3_SCL \
	BFLB_PINMUX(4, i2c3, scl, periph)

/* gpio4_dbi_b_wr */
#define GPIO4_DBI_B_WR \
	BFLB_PINMUX(4, dbi_b, wr, periph)

/* gpio4_dbi_c_scl */
#define GPIO4_DBI_C_SCL \
	BFLB_PINMUX(4, dbi_c, scl, periph)

/* gpio4_jtag_lp_tms */
#define GPIO4_JTAG_LP_TMS \
	BFLB_PINMUX(4, jtag_lp, tms, periph)

/* gpio4_jtag_m0_tms */
#define GPIO4_JTAG_M0_TMS \
	BFLB_PINMUX(4, jtag_m0, tms, periph)

/* gpio4_jtag_d0_tms */
#define GPIO4_JTAG_D0_TMS \
	BFLB_PINMUX(4, jtag_d0, tms, periph)

/* gpio4_adc_ch2 */
#define GPIO4_ADC_CH2 \
	BFLB_PINMUX(4, adc, ch2, analog)

/* gpio4_dac_chb */
#define GPIO4_DAC_CHB \
	BFLB_PINMUX(4, dac, chb, analog)

/* gpio5_sdh_dat3 */
#define GPIO5_SDH_DAT3 \
	BFLB_PINMUX(5, sdh, dat3, periph)

/* gpio5_spi0_sclk */
#define GPIO5_SPI0_SCLK \
	BFLB_PINMUX(5, spi0, sclk, periph)

/* gpio5_flash1_d1 */
#define GPIO5_FLASH1_D1 \
	BFLB_PINMUX(5, flash1, d1, periph)

/* gpio5_i2s_fs */
#define GPIO5_I2S_FS \
	BFLB_PINMUX(5, i2s, fs, periph)

/* gpio5_pdm_in */
#define GPIO5_PDM_IN \
	BFLB_PINMUX(5, pdm, in, periph)

/* gpio5_i2c0_sda */
#define GPIO5_I2C0_SDA \
	BFLB_PINMUX(5, i2c0, sda, periph)

/* gpio5_i2c1_sda */
#define GPIO5_I2C1_SDA \
	BFLB_PINMUX(5, i2c1, sda, periph)

/* gpio5_uart0_rts */
#define GPIO5_UART0_RTS \
	BFLB_PINMUX(5, uart0, rts, periph)

/* gpio5_uart0_cts */
#define GPIO5_UART0_CTS \
	BFLB_PINMUX(5, uart0, cts, periph)

/* gpio5_uart0_tx */
#define GPIO5_UART0_TX \
	BFLB_PINMUX(5, uart0, tx, periph)

/* gpio5_uart0_rx */
#define GPIO5_UART0_RX \
	BFLB_PINMUX(5, uart0, rx, periph)

/* gpio5_uart1_rts */
#define GPIO5_UART1_RTS \
	BFLB_PINMUX(5, uart1, rts, periph)

