will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio15_uart1_tx */
#define GPIO15_UART1_TX \
	BFLB_PINMUX(15, uart1, tx, periph)

/* gpio15_uart1_rx */
#define GPIO15_UART1_RX \
	BFLB_PINMUX(15, uart1, rx, periph)

/* gpio15_uart2_rts */
#define GPIO15_UART2_RTS \
	BFLB_PINMUX(15, uart2, rts, periph)

/* gpio15_uart2_cts */
#define GPIO15_UART2_CTS \
	BFLB_PINMUX(15, uart2, cts, periph)

/* gpio15_uart2_tx */
#define GPIO15_UART2_TX \
	BFLB_PINMUX(15, uart2, tx, periph)

/* gpio15_uart2_rx */
#define GPIO15_UART2_RX \
	BFLB_PINMUX(15, uart2, rx, periph)

/* gpio15_pwm0_ch3p */
#define GPIO15_PWM0_CH3P \
	BFLB_PINMUX(15, pwm0, ch3p, periph)

/* gpio15_pwm1_ch3p */
#define GPIO15_PWM1_CH3P \
	BFLB_PINMUX(15, pwm1, ch3p, periph)

/* gpio15_spi1_mosi */
#define GPIO15_SPI1_MOSI \
	BFLB_PINMUX(15, spi1, mosi, periph)

/* gpio15_i2c2_sda */
#define GPIO15_I2C2_SDA \
	BFLB_PINMUX(15, i2c2, sda, periph)

/* gpio15_i2c3_sda */
#define GPIO15_I2C3_SDA \
	BFLB_PINMUX(15, i2c3, sda, periph)

/* gpio15_dbi_b_db7 */
#define GPIO15_DBI_B_DB7 \
	BFLB_PINMUX(15, dbi_b, db7, periph)

/* gpio15_dbi_c_dc */
#define GPIO15_DBI_C_DC \
	BFLB_PINMUX(15, dbi_c, dc, periph)

/* gpio15_jtag_lp_tdi */
#define GPIO15_JTAG_LP_TDI \
	BFLB_PINMUX(15, jtag_lp, tdi, periph)

/* gpio15_jtag_m0_tdi */
#define GPIO15_JTAG_M0_TDI \
	BFLB_PINMUX(15, jtag_m0, tdi, periph)

/* gpio15_jtag_d0_tdi */
#define GPIO15_JTAG_D0_TDI \
	BFLB_PINMUX(15, jtag_d0, tdi, periph)

/* gpio16_spi0_ss */
#define GPIO16_SPI0_SS \
	BFLB_PINMUX(16, spi0, ss, periph)

/* gpio16_i2s_bclk */
#define GPIO16_I2S_BCLK \
	BFLB_PINMUX(16, i2s, bclk, periph)

/* gpio16_pdm_clk */
#define GPIO16_PDM_CLK \
	BFLB_PINMUX(16, pdm, clk, periph)

/* gpio16_i2c0_scl */
#define GPIO16_I2C0_SCL \
	BFLB_PINMUX(16, i2c0, scl, periph)

/* gpio16_i2c1_scl */
#define GPIO16_I2C1_SCL \
	BFLB_PINMUX(16, i2c1, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_uart1_rts */
#define GPIO16_UART1_RTS \
	BFLB_PINMUX(16, uart1, rts, periph)

/* gpio16_uart1_cts */
#define GPIO16_UART1_CTS \
	BFLB_PINMUX(16, uart1, cts, periph)

/* gpio16_uart1_tx */
#define GPIO16_UART1_TX \
	BFLB_PINMUX(16, uart1, tx, periph)

/* gpio16_uart1_rx */
#define GPIO16_UART1_RX \
	BFLB_PINMUX(16, uart1, rx, periph)

/* gpio16_uart2_rts */
#define GPIO16_UART2_RTS \
	BFLB_PINMUX(16, uart2, rts, periph)

/* gpio16_uart2_cts */
#define GPIO16_UART2_CTS \
	BFLB_PINMUX(16, uart2, cts, periph)

/* gpio16_uart2_tx */
#define GPIO16_UART2_TX \
	BFLB_PINMUX(16, uart2, tx, periph)

/* gpio16_uart2_rx */
#define GPIO16_UART2_RX \
	BFLB_PINMUX(16, uart2, rx, periph)

/* gpio16_cam1_dat6 */
#define GPIO16_CAM1_DAT6 \
	BFLB_PINMUX(16, cam1, dat6, periph)

/* gpio16_pwm0_ch0p */
#define GPIO16_PWM0_CH0P \
	BFLB_PINMUX(16, pwm0, ch0p, periph)

/* gpio16_pwm1_ch0p */
#define GPIO16_PWM1_CH0P \
	BFLB_PINMUX(16, pwm1, ch0p, periph)

/* gpio16_spi1_ss */
#define GPIO16_SPI1_SS \
	BFLB_PINMUX(16, spi1, ss, periph)

/* gpio16_i2c2_scl */
#define GPIO16_I2C2_SCL \
	BFLB_PINMUX(16, i2c2, scl, periph)

/* gpio16_i2c3_scl */
#define GPIO16_I2C3_SCL \
	BFLB_PINMUX(16, i2c3, scl, periph)

/* gpio16_jtag_lp_tms */
#define GPIO16_JTAG_LP_TMS \
	BFLB_PINMUX(16, jtag_lp, tms, periph)

/* gpio16_jtag_m0_tms */
#define GPIO16_JTAG_M0_TMS \
	BFLB_PINMUX(16, jtag_m0, tms, periph)

/* gpio16_jtag_d0_tms */
#define GPIO16_JTAG_D0_TMS \
	BFLB_PINMUX(16, jtag_d0, tms, periph)

/* gpio16_adc_ch8 */
#define GPIO16_ADC_CH8 \
	BFLB_PINMUX(16, adc, ch8, analog)

/* gpio17_spi0_sclk */
#define GPIO17_SPI0_SCLK \
	BFLB_PINMUX(17, spi0, sclk, periph)

/* gpio17_i2s_fs */
#define GPIO17_I2S_FS \
	BFLB_PINMUX(17, i2s, fs, periph)

/* gpio17_pdm_in */
#define GPIO17_PDM_IN \
	BFLB_PINMUX(17, pdm, in, periph)

/* gpio17_i2c0_sda */
#define GPIO17_I2C0_SDA \
	BFLB_PINMUX(17, i2c0, sda, periph)

/* gpio17_i2c1_sda */
#define GPIO17_I2C1_SDA \
	BFLB_PINMUX(17, i2c1, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_uart1_rts */
#define GPIO17_UART1_RTS \
	BFLB_PINMUX(17, uart1, rts, periph)

/* gpio17_uart1_cts */
#define GPIO17_UART1_CTS \
	BFLB_PINMUX(17, uart1, cts, periph)

/* gpio17_uart1_tx */
#define GPIO17_UART1_TX \
	BFLB_PINMUX(17, uart1, tx, periph)

/* gpio17_uart1_rx */
#define GPIO17_UART1_RX \
	BFLB_PINMUX(17, uart1, rx, periph)

/* gpio17_uart2_rts */
#define GPIO17_UART2_RTS \
	BFLB_PINMUX(17, uart2, rts, periph)

/* gpio17_uart2_cts */
#define GPIO17_UART2_CTS \
	BFLB_PINMUX(17, uart2, cts, periph)

/* gpio17_uart2_tx */
#define GPIO17_UART2_TX \
	BFLB_PINMUX(17, uart2, tx, periph)

/* gpio17_uart2_rx */
#define GPIO17_UART2_RX \
	BFLB_PINMUX(17, uart2, rx, periph)

/* gpio17_cam1_dat7 */
#define GPIO17_CAM1_DAT7 \
	BFLB_PINMUX(17, cam1, dat7, periph)

/* gpio17_pwm0_ch1p */
#define GPIO17_PWM0_CH1P \
	BFLB_PINMUX(17, pwm0, ch1p, periph)

/* gpio17_pwm1_ch1p */
#define GPIO17_PWM1_CH1P \
	BFLB_PINMUX(17, pwm1, ch1p, periph)

/* gpio17_spi1_sclk */
#define GPIO17_SPI1_SCLK \
	BFLB_PINMUX(17, spi1, sclk, periph)

/* gpio17_i2c2_sda */
#define GPIO17_I2C2_SDA \
	BFLB_PINMUX(17, i2c2, sda, periph)

/* gpio17_i2c3_sda */
#define GPIO17_I2C3_SDA \
	BFLB_PINMUX(17, i2c3, sda, periph)

/* gpio17_jtag_lp_tck */
#define GPIO17_JTAG_LP_TCK \
	BFLB_PINMUX(17, jtag_lp, tck, periph)

/* gpio17_jtag_m0_tck */
#define GPIO17_JTAG_M0_TCK \
	BFLB_PINMUX(17, jtag_m0, tck, periph)

/* gpio17_jtag_d0_tck */
#define GPIO17_JTAG_D0_TCK \
	BFLB_PINMUX(17, jtag_d0, tck, periph)

/* gpio17_adc_ch0 */
#define GPIO17_ADC_CH0 \
	BFLB_PINMUX(17, adc, ch0, analog)

