will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio18_spi0_miso */
#define GPIO18_SPI0_MISO \
	BFLB_PINMUX(18, spi0, miso, periph)

/* gpio18_i2s_di */
#define GPIO18_I2S_DI \
	BFLB_PINMUX(18, i2s, di, periph)

/* gpio18_pdm_clk */
#define GPIO18_PDM_CLK \
	BFLB_PINMUX(18, pdm, clk, periph)

/* gpio18_i2c0_scl */
#define GPIO18_I2C0_SCL \
	BFLB_PINMUX(18, i2c0, scl, periph)

/* gpio18_i2c1_scl */
#define GPIO18_I2C1_SCL \
	BFLB_PINMUX(18, i2c1, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_uart1_rts */
#define GPIO18_UART1_RTS \
	BFLB_PINMUX(18, uart1, rts, periph)

/* gpio18_uart1_cts */
#define GPIO18_UART1_CTS \
	BFLB_PINMUX(18, uart1, cts, periph)

/* gpio18_uart1_tx */
#define GPIO18_UART1_TX \
	BFLB_PINMUX(18, uart1, tx, periph)

/* gpio18_uart1_rx */
#define GPIO18_UART1_RX \
	BFLB_PINMUX(18, uart1, rx, periph)

/* gpio18_uart2_rts */
#define GPIO18_UART2_RTS \
	BFLB_PINMUX(18, uart2, rts, periph)

/* gpio18_uart2_cts */
#define GPIO18_UART2_CTS \
	BFLB_PINMUX(18, uart2, cts, periph)

/* gpio18_uart2_tx */
#define GPIO18_UART2_TX \
	BFLB_PINMUX(18, uart2, tx, periph)

/* gpio18_uart2_rx */
#define GPIO18_UART2_RX \
	BFLB_PINMUX(18, uart2, rx, periph)

/* gpio18_pwm0_ch2p */
#define GPIO18_PWM0_CH2P \
	BFLB_PINMUX(18, pwm0, ch2p, periph)

/* gpio18_pwm1_ch2p */
#define GPIO18_PWM1_CH2P \
	BFLB_PINMUX(18, pwm1, ch2p, periph)

/* gpio18_spi1_miso */
#define GPIO18_SPI1_MISO \
	BFLB_PINMUX(18, spi1, miso, periph)

/* gpio18_i2c2_scl */
#define GPIO18_I2C2_SCL \
	BFLB_PINMUX(18, i2c2, scl, periph)

/* gpio18_i2c3_scl */
#define GPIO18_I2C3_SCL \
	BFLB_PINMUX(18, i2c3, scl, periph)

/* gpio18_jtag_lp_tdo */
#define GPIO18_JTAG_LP_TDO \
	BFLB_PINMUX(18, jtag_lp, tdo, periph)

/* gpio18_jtag_m0_tdo */
#define GPIO18_JTAG_M0_TDO \
	BFLB_PINMUX(18, jtag_m0, tdo, periph)

/* gpio18_jtag_d0_tdo */
#define GPIO18_JTAG_D0_TDO \
	BFLB_PINMUX(18, jtag_d0, tdo, periph)

/* gpio18_adc_ch9 */
#define GPIO18_ADC_CH9 \
	BFLB_PINMUX(18, adc, ch9, analog)

/* gpio19_spi0_mosi */
#define GPIO19_SPI0_MOSI \
	BFLB_PINMUX(19, spi0, mosi, periph)

/* gpio19_i2s_do */
#define GPIO19_I2S_DO \
	BFLB_PINMUX(19, i2s, do, periph)

/* gpio19_pdm_in */
#define GPIO19_PDM_IN \
	BFLB_PINMUX(19, pdm, in, periph)

/* gpio19_i2c0_sda */
#define GPIO19_I2C0_SDA \
	BFLB_PINMUX(19, i2c0, sda, periph)

/* gpio19_i2c1_sda */
#define GPIO19_I2C1_SDA \
	BFLB_PINMUX(19, i2c1, sda, periph)

/* gpio19_uart0_rts */
#define GPIO19_UART0_RTS \
	BFLB_PINMUX(19, uart0, rts, periph)

/* gpio19_uart0_cts */
#define GPIO19_UART0_CTS \
	BFLB_PINMUX(19, uart0, cts, periph)

/* gpio19_uart0_tx */
#define GPIO19_UART0_TX \
	BFLB_PINMUX(19, uart0, tx, periph)

/* gpio19_uart0_rx */
#define GPIO19_UART0_RX \
	BFLB_PINMUX(19, uart0, rx, periph)

/* gpio19_uart1_rts */
#define GPIO19_UART1_RTS \
	BFLB_PINMUX(19, uart1, rts, periph)

/* gpio19_uart1_cts */
#define GPIO19_UART1_CTS \
	BFLB_PINMUX(19, uart1, cts, periph)

/* gpio19_uart1_tx */
#define GPIO19_UART1_TX \
	BFLB_PINMUX(19, uart1, tx, periph)

/* gpio19_uart1_rx */
#define GPIO19_UART1_RX \
	BFLB_PINMUX(19, uart1, rx, periph)

/* gpio19_uart2_rts */
#define GPIO19_UART2_RTS \
	BFLB_PINMUX(19, uart2, rts, periph)

/* gpio19_uart2_cts */
#define GPIO19_UART2_CTS \
	BFLB_PINMUX(19, uart2, cts, periph)

/* gpio19_uart2_tx */
#define GPIO19_UART2_TX \
	BFLB_PINMUX(19, uart2, tx, periph)

/* gpio19_uart2_rx */
#define GPIO19_UART2_RX \
	BFLB_PINMUX(19, uart2, rx, periph)

/* gpio19_pwm0_ch3p */
#define GPIO19_PWM0_CH3P \
	BFLB_PINMUX(19, pwm0, ch3p, periph)

/* gpio19_pwm1_ch3p */
#define GPIO19_PWM1_CH3P \
	BFLB_PINMUX(19, pwm1, ch3p, periph)

/* gpio19_spi1_mosi */
#define GPIO19_SPI1_MOSI \
	BFLB_PINMUX(19, spi1, mosi, periph)

/* gpio19_i2c2_sda */
#define GPIO19_I2C2_SDA \
	BFLB_PINMUX(19, i2c2, sda, periph)

/* gpio19_i2c3_sda */
#define GPIO19_I2C3_SDA \
	BFLB_PINMUX(19, i2c3, sda, periph)

/* gpio19_jtag_lp_tdi */
#define GPIO19_JTAG_LP_TDI \
	BFLB_PINMUX(19, jtag_lp, tdi, periph)

/* gpio19_jtag_m0_tdi */
#define GPIO19_JTAG_M0_TDI \
	BFLB_PINMUX(19, jtag_m0, tdi, periph)

/* gpio19_jtag_d0_tdi */
#define GPIO19_JTAG_D0_TDI \
	BFLB_PINMUX(19, jtag_d0, tdi, periph)

/* gpio19_adc_ch10 */
#define GPIO19_ADC_CH10 \
	BFLB_PINMUX(19, adc, ch10, analog)

/* gpio20_spi0_ss */
#define GPIO20_SPI0_SS \
	BFLB_PINMUX(20, spi0, ss, periph)

/* gpio20_i2s_bclk */
#define GPIO20_I2S_BCLK \
	BFLB_PINMUX(20, i2s, bclk, periph)

/* gpio20_pdm_clk */
#define GPIO20_PDM_CLK \
	BFLB_PINMUX(20, pdm, clk, periph)

/* gpio20_i2c0_scl */
#define GPIO20_I2C0_SCL \
	BFLB_PINMUX(20, i2c0, scl, periph)

/* gpio20_i2c1_scl */
#define GPIO20_I2C1_SCL \
	BFLB_PINMUX(20, i2c1, scl, periph)

/* gpio20_uart0_rts */
#define GPIO20_UART0_RTS \
	BFLB_PINMUX(20, uart0, rts, periph)

/* gpio20_uart0_cts */
#define GPIO20_UART0_CTS \
	BFLB_PINMUX(20, uart0, cts, periph)

/* gpio20_uart0_tx */
#define GPIO20_UART0_TX \
	BFLB_PINMUX(20, uart0, tx, periph)

/* gpio20_uart0_rx */
#define GPIO20_UART0_RX \
	BFLB_PINMUX(20, uart0, rx, periph)

/* gpio20_uart1_rts */
#define GPIO20_UART1_RTS \
	BFLB_PINMUX(20, uart1, rts, periph)

/* gpio20_uart1_cts */
#define GPIO20_UART1_CTS \
	BFLB_PINMUX(20, uart1, cts, periph)

/* gpio20_uart1_tx */
#define GPIO20_UART1_TX \
	BFLB_PINMUX(20, uart1, tx, periph)

/* gpio20_uart1_rx */
#define GPIO20_UART1_RX \
	BFLB_PINMUX(20, uart1, rx, periph)

/* gpio20_uart2_rts */
#define GPIO20_UART2_RTS \
	BFLB_PINMUX(20, uart2, rts, periph)

/* gpio20_uart2_cts */
#define GPIO20_UART2_CTS \
	BFLB_PINMUX(20, uart2, cts, periph)

/* gpio20_uart2_tx */
#define GPIO20_UART2_TX \
	BFLB_PINMUX(20, uart2, tx, periph)

/* gpio20_uart2_rx */
#define GPIO20_UART2_RX \
	BFLB_PINMUX(20, uart2, rx, periph)

/* gpio20_pwm0_ch0p */
#define GPIO20_PWM0_CH0P \
	BFLB_PINMUX(20, pwm0, ch0p, periph)

/* gpio20_pwm1_ch0p */
#define GPIO20_PWM1_CH0P \
	BFLB_PINMUX(20, pwm1, ch0p, periph)

