will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio34_uart0_tx */
#define GPIO34_UART0_TX \
	BFLB_PINMUX(34, uart0, tx, periph)

/* gpio34_uart0_rx */
#define GPIO34_UART0_RX \
	BFLB_PINMUX(34, uart0, rx, periph)

/* gpio34_uart1_rts */
#define GPIO34_UART1_RTS \
	BFLB_PINMUX(34, uart1, rts, periph)

/* gpio34_uart1_cts */
#define GPIO34_UART1_CTS \
	BFLB_PINMUX(34, uart1, cts, periph)

/* gpio34_uart1_tx */
#define GPIO34_UART1_TX \
	BFLB_PINMUX(34, uart1, tx, periph)

/* gpio34_uart1_rx */
#define GPIO34_UART1_RX \
	BFLB_PINMUX(34, uart1, rx, periph)

/* gpio34_uart2_rts */
#define GPIO34_UART2_RTS \
	BFLB_PINMUX(34, uart2, rts, periph)

/* gpio34_uart2_cts */
#define GPIO34_UART2_CTS \
	BFLB_PINMUX(34, uart2, cts, periph)

/* gpio34_uart2_tx */
#define GPIO34_UART2_TX \
	BFLB_PINMUX(34, uart2, tx, periph)

/* gpio34_uart2_rx */
#define GPIO34_UART2_RX \
	BFLB_PINMUX(34, uart2, rx, periph)

/* gpio34_emac_mdio */
#define GPIO34_EMAC_MDIO \
	BFLB_PINMUX(34, emac, mdio, periph)

/* gpio34_cam0_dat7 */
#define GPIO34_CAM0_DAT7 \
	BFLB_PINMUX(34, cam0, dat7, periph)

/* gpio34_pwm0_ch2p */
#define GPIO34_PWM0_CH2P \
	BFLB_PINMUX(34, pwm0, ch2p, periph)

/* gpio34_pwm1_ch2p */
#define GPIO34_PWM1_CH2P \
	BFLB_PINMUX(34, pwm1, ch2p, periph)

/* gpio34_spi1_miso */
#define GPIO34_SPI1_MISO \
	BFLB_PINMUX(34, spi1, miso, periph)

/* gpio34_i2c2_scl */
#define GPIO34_I2C2_SCL \
	BFLB_PINMUX(34, i2c2, scl, periph)

/* gpio34_i2c3_scl */
#define GPIO34_I2C3_SCL \
	BFLB_PINMUX(34, i2c3, scl, periph)

/* gpio34_jtag_lp_tdo */
#define GPIO34_JTAG_LP_TDO \
	BFLB_PINMUX(34, jtag_lp, tdo, periph)

/* gpio34_jtag_m0_tdo */
#define GPIO34_JTAG_M0_TDO \
	BFLB_PINMUX(34, jtag_m0, tdo, periph)

/* gpio34_jtag_d0_tdo */
#define GPIO34_JTAG_D0_TDO \
	BFLB_PINMUX(34, jtag_d0, tdo, periph)

/* gpio34_adc_ch11 */
#define GPIO34_ADC_CH11 \
	BFLB_PINMUX(34, adc, ch11, analog)

/* gpio35_spi0_mosi */
#define GPIO35_SPI0_MOSI \
	BFLB_PINMUX(35, spi0, mosi, periph)

/* gpio35_i2s_do */
#define GPIO35_I2S_DO \
	BFLB_PINMUX(35, i2s, do, periph)

/* gpio35_pdm_in */
#define GPIO35_PDM_IN \
	BFLB_PINMUX(35, pdm, in, periph)

/* gpio35_i2c0_sda */
#define GPIO35_I2C0_SDA \
	BFLB_PINMUX(35, i2c0, sda, periph)

/* gpio35_i2c1_sda */
#define GPIO35_I2C1_SDA \
	BFLB_PINMUX(35, i2c1, sda, periph)

/* gpio35_uart0_rts */
#define GPIO35_UART0_RTS \
	BFLB_PINMUX(35, uart0, rts, periph)

/* gpio35_uart0_cts */
#define GPIO35_UART0_CTS \
	BFLB_PINMUX(35, uart0, cts, periph)

/* gpio35_uart0_tx */
#define GPIO35_UART0_TX \
	BFLB_PINMUX(35, uart0, tx, periph)

/* gpio35_uart0_rx */
#define GPIO35_UART0_RX \
	BFLB_PINMUX(35, uart0, rx, periph)

/* gpio35_uart1_rts */
#define GPIO35_UART1_RTS \
	BFLB_PINMUX(35, uart1, rts, periph)

/* gpio35_uart1_cts */
#define GPIO35_UART1_CTS \
	BFLB_PINMUX(35, uart1, cts, periph)

/* gpio35_uart1_tx */
#define GPIO35_UART1_TX \
	BFLB_PINMUX(35, uart1, tx, periph)

/* gpio35_uart1_rx */
#define GPIO35_UART1_RX \
	BFLB_PINMUX(35, uart1, rx, periph)

/* gpio35_uart2_rts */
#define GPIO35_UART2_RTS \
	BFLB_PINMUX(35, uart2, rts, periph)

/* gpio35_uart2_cts */
#define GPIO35_UART2_CTS \
	BFLB_PINMUX(35, uart2, cts, periph)

/* gpio35_uart2_tx */
#define GPIO35_UART2_TX \
	BFLB_PINMUX(35, uart2, tx, periph)

/* gpio35_uart2_rx */
#define GPIO35_UART2_RX \
	BFLB_PINMUX(35, uart2, rx, periph)

/* gpio35_pwm0_ch3p */
#define GPIO35_PWM0_CH3P \
	BFLB_PINMUX(35, pwm0, ch3p, periph)

/* gpio35_pwm1_ch3p */
#define GPIO35_PWM1_CH3P \
	BFLB_PINMUX(35, pwm1, ch3p, periph)

/* gpio35_spi1_mosi */
#define GPIO35_SPI1_MOSI \
	BFLB_PINMUX(35, spi1, mosi, periph)

/* gpio35_i2c2_sda */
#define GPIO35_I2C2_SDA \
	BFLB_PINMUX(35, i2c2, sda, periph)

/* gpio35_i2c3_sda */
#define GPIO35_I2C3_SDA \
	BFLB_PINMUX(35, i2c3, sda, periph)

/* gpio35_jtag_lp_tdi */
#define GPIO35_JTAG_LP_TDI \
	BFLB_PINMUX(35, jtag_lp, tdi, periph)

/* gpio35_jtag_m0_tdi */
#define GPIO35_JTAG_M0_TDI \
	BFLB_PINMUX(35, jtag_m0, tdi, periph)

/* gpio35_jtag_d0_tdi */
#define GPIO35_JTAG_D0_TDI \
	BFLB_PINMUX(35, jtag_d0, tdi, periph)

/* gpio36_spi0_ss */
#define GPIO36_SPI0_SS \
	BFLB_PINMUX(36, spi0, ss, periph)

/* gpio36_i2s_bclk */
#define GPIO36_I2S_BCLK \
	BFLB_PINMUX(36, i2s, bclk, periph)

/* gpio36_pdm_clk */
#define GPIO36_PDM_CLK \
	BFLB_PINMUX(36, pdm, clk, periph)

/* gpio36_i2c0_scl */
#define GPIO36_I2C0_SCL \
	BFLB_PINMUX(36, i2c0, scl, periph)

/* gpio36_i2c1_scl */
#define GPIO36_I2C1_SCL \
	BFLB_PINMUX(36, i2c1, scl, periph)

/* gpio36_uart0_rts */
#define GPIO36_UART0_RTS \
	BFLB_PINMUX(36, uart0, rts, periph)

/* gpio36_uart0_cts */
#define GPIO36_UART0_CTS \
	BFLB_PINMUX(36, uart0, cts, periph)

/* gpio36_uart0_tx */
#define GPIO36_UART0_TX \
	BFLB_PINMUX(36, uart0, tx, periph)

/* gpio36_uart0_rx */
#define GPIO36_UART0_RX \
	BFLB_PINMUX(36, uart0, rx, periph)

/* gpio36_uart1_rts */
#define GPIO36_UART1_RTS \
	BFLB_PINMUX(36, uart1, rts, periph)

/* gpio36_uart1_cts */
#define GPIO36_UART1_CTS \
	BFLB_PINMUX(36, uart1, cts, periph)

/* gpio36_uart1_tx */
#define GPIO36_UART1_TX \
	BFLB_PINMUX(36, uart1, tx, periph)

/* gpio36_uart1_rx */
#define GPIO36_UART1_RX \
	BFLB_PINMUX(36, uart1, rx, periph)

/* gpio36_uart2_rts */
#define GPIO36_UART2_RTS \
	BFLB_PINMUX(36, uart2, rts, periph)

/* gpio36_uart2_cts */
#define GPIO36_UART2_CTS \
	BFLB_PINMUX(36, uart2, cts, periph)

/* gpio36_uart2_tx */
#define GPIO36_UART2_TX \
	BFLB_PINMUX(36, uart2, tx, periph)

/* gpio36_uart2_rx */
#define GPIO36_UART2_RX \
	BFLB_PINMUX(36, uart2, rx, periph)

/* gpio36_pwm0_ch0p */
#define GPIO36_PWM0_CH0P \
	BFLB_PINMUX(36, pwm0, ch0p, periph)

/* gpio36_pwm1_ch0p */
#define GPIO36_PWM1_CH0P \
	BFLB_PINMUX(36, pwm1, ch0p, periph)

/* gpio36_spi1_ss */
#define GPIO36_SPI1_SS \
	BFLB_PINMUX(36, spi1, ss, periph)

/* gpio36_i2c2_scl */
#define GPIO36_I2C2_SCL \
	BFLB_PINMUX(36, i2c2, scl, periph)

/* gpio36_i2c3_scl */
#define GPIO36_I2C3_SCL \
	BFLB_PINMUX(36, i2c3, scl, periph)

/* gpio36_jtag_lp_tms */
#define GPIO36_JTAG_LP_TMS \
	BFLB_PINMUX(36, jtag_lp, tms, periph)

/* gpio36_jtag_m0_tms */
#define GPIO36_JTAG_M0_TMS \
	BFLB_PINMUX(36, jtag_m0, tms, periph)

/* gpio36_jtag_d0_tms */
#define GPIO36_JTAG_D0_TMS \
	BFLB_PINMUX(36, jtag_d0, tms, periph)

/* gpio37_spi0_sclk */
#define GPIO37_SPI0_SCLK \
	BFLB_PINMUX(37, spi0, sclk, periph)

/* gpio37_i2s_fs */
#define GPIO37_I2S_FS \
	BFLB_PINMUX(37, i2s, fs, periph)

