will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio37_pdm_in */
#define GPIO37_PDM_IN \
	BFLB_PINMUX(37, pdm, in, periph)

/* gpio37_i2c0_sda */
#define GPIO37_I2C0_SDA \
	BFLB_PINMUX(37, i2c0, sda, periph)

/* gpio37_i2c1_sda */
#define GPIO37_I2C1_SDA \
	BFLB_PINMUX(37, i2c1, sda, periph)

/* gpio37_uart0_rts */
#define GPIO37_UART0_RTS \
	BFLB_PINMUX(37, uart0, rts, periph)

/* gpio37_uart0_cts */
#define GPIO37_UART0_CTS \
	BFLB_PINMUX(37, uart0, cts, periph)

/* gpio37_uart0_tx */
#define GPIO37_UART0_TX \
	BFLB_PINMUX(37, uart0, tx, periph)

/* gpio37_uart0_rx */
#define GPIO37_UART0_RX \
	BFLB_PINMUX(37, uart0, rx, periph)

/* gpio37_uart1_rts */
#define GPIO37_UART1_RTS \
	BFLB_PINMUX(37, uart1, rts, periph)

/* gpio37_uart1_cts */
#define GPIO37_UART1_CTS \
	BFLB_PINMUX(37, uart1, cts, periph)

/* gpio37_uart1_tx */
#define GPIO37_UART1_TX \
	BFLB_PINMUX(37, uart1, tx, periph)

/* gpio37_uart1_rx */
#define GPIO37_UART1_RX \
	BFLB_PINMUX(37, uart1, rx, periph)

/* gpio37_uart2_rts */
#define GPIO37_UART2_RTS \
	BFLB_PINMUX(37, uart2, rts, periph)

/* gpio37_uart2_cts */
#define GPIO37_UART2_CTS \
	BFLB_PINMUX(37, uart2, cts, periph)

/* gpio37_uart2_tx */
#define GPIO37_UART2_TX \
	BFLB_PINMUX(37, uart2, tx, periph)

/* gpio37_uart2_rx */
#define GPIO37_UART2_RX \
	BFLB_PINMUX(37, uart2, rx, periph)

/* gpio37_pwm0_ch1p */
#define GPIO37_PWM0_CH1P \
	BFLB_PINMUX(37, pwm0, ch1p, periph)

/* gpio37_pwm1_ch1p */
#define GPIO37_PWM1_CH1P \
	BFLB_PINMUX(37, pwm1, ch1p, periph)

/* gpio37_spi1_sclk */
#define GPIO37_SPI1_SCLK \
	BFLB_PINMUX(37, spi1, sclk, periph)

/* gpio37_i2c2_sda */
#define GPIO37_I2C2_SDA \
	BFLB_PINMUX(37, i2c2, sda, periph)

/* gpio37_i2c3_sda */
#define GPIO37_I2C3_SDA \
	BFLB_PINMUX(37, i2c3, sda, periph)

/* gpio37_jtag_lp_tck */
#define GPIO37_JTAG_LP_TCK \
	BFLB_PINMUX(37, jtag_lp, tck, periph)

/* gpio37_jtag_m0_tck */
#define GPIO37_JTAG_M0_TCK \
	BFLB_PINMUX(37, jtag_m0, tck, periph)

/* gpio37_jtag_d0_tck */
#define GPIO37_JTAG_D0_TCK \
	BFLB_PINMUX(37, jtag_d0, tck, periph)

/* gpio38_spi0_miso */
#define GPIO38_SPI0_MISO \
	BFLB_PINMUX(38, spi0, miso, periph)

/* gpio38_i2s_di */
#define GPIO38_I2S_DI \
	BFLB_PINMUX(38, i2s, di, periph)

/* gpio38_pdm_clk */
#define GPIO38_PDM_CLK \
	BFLB_PINMUX(38, pdm, clk, periph)

/* gpio38_i2c0_scl */
#define GPIO38_I2C0_SCL \
	BFLB_PINMUX(38, i2c0, scl, periph)

/* gpio38_i2c1_scl */
#define GPIO38_I2C1_SCL \
	BFLB_PINMUX(38, i2c1, scl, periph)

/* gpio38_uart0_rts */
#define GPIO38_UART0_RTS \
	BFLB_PINMUX(38, uart0, rts, periph)

/* gpio38_uart0_cts */
#define GPIO38_UART0_CTS \
	BFLB_PINMUX(38, uart0, cts, periph)

/* gpio38_uart0_tx */
#define GPIO38_UART0_TX \
	BFLB_PINMUX(38, uart0, tx, periph)

/* gpio38_uart0_rx */
#define GPIO38_UART0_RX \
	BFLB_PINMUX(38, uart0, rx, periph)

/* gpio38_uart1_rts */
#define GPIO38_UART1_RTS \
	BFLB_PINMUX(38, uart1, rts, periph)

/* gpio38_uart1_cts */
#define GPIO38_UART1_CTS \
	BFLB_PINMUX(38, uart1, cts, periph)

/* gpio38_uart1_tx */
#define GPIO38_UART1_TX \
	BFLB_PINMUX(38, uart1, tx, periph)

/* gpio38_uart1_rx */
#define GPIO38_UART1_RX \
	BFLB_PINMUX(38, uart1, rx, periph)

/* gpio38_uart2_rts */
#define GPIO38_UART2_RTS \
	BFLB_PINMUX(38, uart2, rts, periph)

/* gpio38_uart2_cts */
#define GPIO38_UART2_CTS \
	BFLB_PINMUX(38, uart2, cts, periph)

/* gpio38_uart2_tx */
#define GPIO38_UART2_TX \
	BFLB_PINMUX(38, uart2, tx, periph)

/* gpio38_uart2_rx */
#define GPIO38_UART2_RX \
	BFLB_PINMUX(38, uart2, rx, periph)

/* gpio38_pwm0_ch2p */
#define GPIO38_PWM0_CH2P \
	BFLB_PINMUX(38, pwm0, ch2p, periph)

/* gpio38_pwm1_ch2p */
#define GPIO38_PWM1_CH2P \
	BFLB_PINMUX(38, pwm1, ch2p, periph)

/* gpio38_spi1_miso */
#define GPIO38_SPI1_MISO \
	BFLB_PINMUX(38, spi1, miso, periph)

/* gpio38_i2c2_scl */
#define GPIO38_I2C2_SCL \
	BFLB_PINMUX(38, i2c2, scl, periph)

/* gpio38_i2c3_scl */
#define GPIO38_I2C3_SCL \
	BFLB_PINMUX(38, i2c3, scl, periph)

/* gpio38_jtag_lp_tdo */
#define GPIO38_JTAG_LP_TDO \
	BFLB_PINMUX(38, jtag_lp, tdo, periph)

/* gpio38_jtag_m0_tdo */
#define GPIO38_JTAG_M0_TDO \
	BFLB_PINMUX(38, jtag_m0, tdo, periph)

/* gpio38_jtag_d0_tdo */
#define GPIO38_JTAG_D0_TDO \
	BFLB_PINMUX(38, jtag_d0, tdo, periph)

/* gpio39_spi0_mosi */
#define GPIO39_SPI0_MOSI \
	BFLB_PINMUX(39, spi0, mosi, periph)

/* gpio39_i2s_do */
#define GPIO39_I2S_DO \
	BFLB_PINMUX(39, i2s, do, periph)

/* gpio39_pdm_in */
#define GPIO39_PDM_IN \
	BFLB_PINMUX(39, pdm, in, periph)

/* gpio39_i2c0_sda */
#define GPIO39_I2C0_SDA \
	BFLB_PINMUX(39, i2c0, sda, periph)

/* gpio39_i2c1_sda */
#define GPIO39_I2C1_SDA \
	BFLB_PINMUX(39, i2c1, sda, periph)

/* gpio39_uart0_rts */
#define GPIO39_UART0_RTS \
	BFLB_PINMUX(39, uart0, rts, periph)

/* gpio39_uart0_cts */
#define GPIO39_UART0_CTS \
	BFLB_PINMUX(39, uart0, cts, periph)

/* gpio39_uart0_tx */
#define GPIO39_UART0_TX \
	BFLB_PINMUX(39, uart0, tx, periph)

/* gpio39_uart0_rx */
#define GPIO39_UART0_RX \
	BFLB_PINMUX(39, uart0, rx, periph)

/* gpio39_uart1_rts */
#define GPIO39_UART1_RTS \
	BFLB_PINMUX(39, uart1, rts, periph)

/* gpio39_uart1_cts */
#define GPIO39_UART1_CTS \
	BFLB_PINMUX(39, uart1, cts, periph)

/* gpio39_uart1_tx */
#define GPIO39_UART1_TX \
	BFLB_PINMUX(39, uart1, tx, periph)

/* gpio39_uart1_rx */
#define GPIO39_UART1_RX \
	BFLB_PINMUX(39, uart1, rx, periph)

/* gpio39_uart2_rts */
#define GPIO39_UART2_RTS \
	BFLB_PINMUX(39, uart2, rts, periph)

/* gpio39_uart2_cts */
#define GPIO39_UART2_CTS \
	BFLB_PINMUX(39, uart2, cts, periph)

/* gpio39_uart2_tx */
#define GPIO39_UART2_TX \
	BFLB_PINMUX(39, uart2, tx, periph)

/* gpio39_uart2_rx */
#define GPIO39_UART2_RX \
	BFLB_PINMUX(39, uart2, rx, periph)

/* gpio39_pwm0_ch3p */
#define GPIO39_PWM0_CH3P \
	BFLB_PINMUX(39, pwm0, ch3p, periph)

/* gpio39_pwm1_ch3p */
#define GPIO39_PWM1_CH3P \
	BFLB_PINMUX(39, pwm1, ch3p, periph)

/* gpio39_spi1_mosi */
#define GPIO39_SPI1_MOSI \
	BFLB_PINMUX(39, spi1, mosi, periph)

/* gpio39_i2c2_sda */
#define GPIO39_I2C2_SDA \
	BFLB_PINMUX(39, i2c2, sda, periph)

/* gpio39_i2c3_sda */
#define GPIO39_I2C3_SDA \
	BFLB_PINMUX(39, i2c3, sda, periph)

/* gpio39_jtag_lp_tdi */
#define GPIO39_JTAG_LP_TDI \
	BFLB_PINMUX(39, jtag_lp, tdi, periph)

/* gpio39_jtag_m0_tdi */
#define GPIO39_JTAG_M0_TDI \
	BFLB_PINMUX(39, jtag_m0, tdi, periph)

/* gpio39_jtag_d0_tdi */
#define GPIO39_JTAG_D0_TDI \
	BFLB_PINMUX(39, jtag_d0, tdi, periph)

/* gpio40_spi0_ss */
#define GPIO40_SPI0_SS \
	BFLB_PINMUX(40, spi0, ss, periph)

