will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808cx-pinctrl.h
/* gpio42_jtag_d0_tdo */
#define GPIO42_JTAG_D0_TDO \
	BFLB_PINMUX(42, jtag_d0, tdo, periph)

/* gpio43_spi0_mosi */
#define GPIO43_SPI0_MOSI \
	BFLB_PINMUX(43, spi0, mosi, periph)

/* gpio43_i2s_do */
#define GPIO43_I2S_DO \
	BFLB_PINMUX(43, i2s, do, periph)

/* gpio43_pdm_in */
#define GPIO43_PDM_IN \
	BFLB_PINMUX(43, pdm, in, periph)

/* gpio43_i2c0_sda */
#define GPIO43_I2C0_SDA \
	BFLB_PINMUX(43, i2c0, sda, periph)

/* gpio43_i2c1_sda */
#define GPIO43_I2C1_SDA \
	BFLB_PINMUX(43, i2c1, sda, periph)

/* gpio43_uart0_rts */
#define GPIO43_UART0_RTS \
	BFLB_PINMUX(43, uart0, rts, periph)

/* gpio43_uart0_cts */
#define GPIO43_UART0_CTS \
	BFLB_PINMUX(43, uart0, cts, periph)

/* gpio43_uart0_tx */
#define GPIO43_UART0_TX \
	BFLB_PINMUX(43, uart0, tx, periph)

/* gpio43_uart0_rx */
#define GPIO43_UART0_RX \
	BFLB_PINMUX(43, uart0, rx, periph)

/* gpio43_uart1_rts */
#define GPIO43_UART1_RTS \
	BFLB_PINMUX(43, uart1, rts, periph)

/* gpio43_uart1_cts */
#define GPIO43_UART1_CTS \
	BFLB_PINMUX(43, uart1, cts, periph)

/* gpio43_uart1_tx */
#define GPIO43_UART1_TX \
	BFLB_PINMUX(43, uart1, tx, periph)

/* gpio43_uart1_rx */
#define GPIO43_UART1_RX \
	BFLB_PINMUX(43, uart1, rx, periph)

/* gpio43_uart2_rts */
#define GPIO43_UART2_RTS \
	BFLB_PINMUX(43, uart2, rts, periph)

/* gpio43_uart2_cts */
#define GPIO43_UART2_CTS \
	BFLB_PINMUX(43, uart2, cts, periph)

/* gpio43_uart2_tx */
#define GPIO43_UART2_TX \
	BFLB_PINMUX(43, uart2, tx, periph)

/* gpio43_uart2_rx */
#define GPIO43_UART2_RX \
	BFLB_PINMUX(43, uart2, rx, periph)

/* gpio43_pwm0_ch3p */
#define GPIO43_PWM0_CH3P \
	BFLB_PINMUX(43, pwm0, ch3p, periph)

/* gpio43_pwm1_ch3p */
#define GPIO43_PWM1_CH3P \
	BFLB_PINMUX(43, pwm1, ch3p, periph)

/* gpio43_spi1_mosi */
#define GPIO43_SPI1_MOSI \
	BFLB_PINMUX(43, spi1, mosi, periph)

/* gpio43_i2c2_sda */
#define GPIO43_I2C2_SDA \
	BFLB_PINMUX(43, i2c2, sda, periph)

/* gpio43_i2c3_sda */
#define GPIO43_I2C3_SDA \
	BFLB_PINMUX(43, i2c3, sda, periph)

/* gpio43_jtag_lp_tdi */
#define GPIO43_JTAG_LP_TDI \
	BFLB_PINMUX(43, jtag_lp, tdi, periph)

/* gpio43_jtag_m0_tdi */
#define GPIO43_JTAG_M0_TDI \
	BFLB_PINMUX(43, jtag_m0, tdi, periph)

/* gpio43_jtag_d0_tdi */
#define GPIO43_JTAG_D0_TDI \
	BFLB_PINMUX(43, jtag_d0, tdi, periph)

/* gpio44_spi0_ss */
#define GPIO44_SPI0_SS \
	BFLB_PINMUX(44, spi0, ss, periph)

/* gpio44_i2s_bclk */
#define GPIO44_I2S_BCLK \
	BFLB_PINMUX(44, i2s, bclk, periph)

/* gpio44_pdm_clk */
#define GPIO44_PDM_CLK \
	BFLB_PINMUX(44, pdm, clk, periph)

/* gpio44_i2c0_scl */
#define GPIO44_I2C0_SCL \
	BFLB_PINMUX(44, i2c0, scl, periph)

/* gpio44_i2c1_scl */
#define GPIO44_I2C1_SCL \
	BFLB_PINMUX(44, i2c1, scl, periph)

/* gpio44_uart0_rts */
#define GPIO44_UART0_RTS \
	BFLB_PINMUX(44, uart0, rts, periph)

/* gpio44_uart0_cts */
#define GPIO44_UART0_CTS \
	BFLB_PINMUX(44, uart0, cts, periph)

/* gpio44_uart0_tx */
#define GPIO44_UART0_TX \
	BFLB_PINMUX(44, uart0, tx, periph)

/* gpio44_uart0_rx */
#define GPIO44_UART0_RX \
	BFLB_PINMUX(44, uart0, rx, periph)

/* gpio44_uart1_rts */
#define GPIO44_UART1_RTS \
	BFLB_PINMUX(44, uart1, rts, periph)

/* gpio44_uart1_cts */
#define GPIO44_UART1_CTS \
	BFLB_PINMUX(44, uart1, cts, periph)

/* gpio44_uart1_tx */
#define GPIO44_UART1_TX \
	BFLB_PINMUX(44, uart1, tx, periph)

/* gpio44_uart1_rx */
#define GPIO44_UART1_RX \
	BFLB_PINMUX(44, uart1, rx, periph)

/* gpio44_uart2_rts */
#define GPIO44_UART2_RTS \
	BFLB_PINMUX(44, uart2, rts, periph)

/* gpio44_uart2_cts */
#define GPIO44_UART2_CTS \
	BFLB_PINMUX(44, uart2, cts, periph)

/* gpio44_uart2_tx */
#define GPIO44_UART2_TX \
	BFLB_PINMUX(44, uart2, tx, periph)

/* gpio44_uart2_rx */
#define GPIO44_UART2_RX \
	BFLB_PINMUX(44, uart2, rx, periph)

/* gpio44_pwm0_ch0p */
#define GPIO44_PWM0_CH0P \
	BFLB_PINMUX(44, pwm0, ch0p, periph)

/* gpio44_pwm1_ch0p */
#define GPIO44_PWM1_CH0P \
	BFLB_PINMUX(44, pwm1, ch0p, periph)

/* gpio44_spi1_ss */
#define GPIO44_SPI1_SS \
	BFLB_PINMUX(44, spi1, ss, periph)

/* gpio44_i2c2_scl */
#define GPIO44_I2C2_SCL \
	BFLB_PINMUX(44, i2c2, scl, periph)

/* gpio44_i2c3_scl */
#define GPIO44_I2C3_SCL \
	BFLB_PINMUX(44, i2c3, scl, periph)

/* gpio44_jtag_lp_tms */
#define GPIO44_JTAG_LP_TMS \
	BFLB_PINMUX(44, jtag_lp, tms, periph)

/* gpio44_jtag_m0_tms */
#define GPIO44_JTAG_M0_TMS \
	BFLB_PINMUX(44, jtag_m0, tms, periph)

/* gpio44_jtag_d0_tms */
#define GPIO44_JTAG_D0_TMS \
	BFLB_PINMUX(44, jtag_d0, tms, periph)

/* gpio45_spi0_sclk */
#define GPIO45_SPI0_SCLK \
	BFLB_PINMUX(45, spi0, sclk, periph)

/* gpio45_i2s_fs */
#define GPIO45_I2S_FS \
	BFLB_PINMUX(45, i2s, fs, periph)

/* gpio45_pdm_in */
#define GPIO45_PDM_IN \
	BFLB_PINMUX(45, pdm, in, periph)

/* gpio45_i2c0_sda */
#define GPIO45_I2C0_SDA \
	BFLB_PINMUX(45, i2c0, sda, periph)

/* gpio45_i2c1_sda */
#define GPIO45_I2C1_SDA \
	BFLB_PINMUX(45, i2c1, sda, periph)

/* gpio45_uart0_rts */
#define GPIO45_UART0_RTS \
	BFLB_PINMUX(45, uart0, rts, periph)

/* gpio45_uart0_cts */
#define GPIO45_UART0_CTS \
	BFLB_PINMUX(45, uart0, cts, periph)

/* gpio45_uart0_tx */
#define GPIO45_UART0_TX \
	BFLB_PINMUX(45, uart0, tx, periph)

/* gpio45_uart0_rx */
#define GPIO45_UART0_RX \
	BFLB_PINMUX(45, uart0, rx, periph)

/* gpio45_uart1_rts */
#define GPIO45_UART1_RTS \
	BFLB_PINMUX(45, uart1, rts, periph)

/* gpio45_uart1_cts */
#define GPIO45_UART1_CTS \
	BFLB_PINMUX(45, uart1, cts, periph)

/* gpio45_uart1_tx */
#define GPIO45_UART1_TX \
	BFLB_PINMUX(45, uart1, tx, periph)

/* gpio45_uart1_rx */
#define GPIO45_UART1_RX \
	BFLB_PINMUX(45, uart1, rx, periph)

/* gpio45_uart2_rts */
#define GPIO45_UART2_RTS \
	BFLB_PINMUX(45, uart2, rts, periph)

/* gpio45_uart2_cts */
#define GPIO45_UART2_CTS \
	BFLB_PINMUX(45, uart2, cts, periph)

/* gpio45_uart2_tx */
#define GPIO45_UART2_TX \
	BFLB_PINMUX(45, uart2, tx, periph)

/* gpio45_uart2_rx */
#define GPIO45_UART2_RX \
	BFLB_PINMUX(45, uart2, rx, periph)

/* gpio45_pwm0_ch1p */
#define GPIO45_PWM0_CH1P \
	BFLB_PINMUX(45, pwm0, ch1p, periph)

/* gpio45_pwm1_ch1p */
#define GPIO45_PWM1_CH1P \
	BFLB_PINMUX(45, pwm1, ch1p, periph)

/* gpio45_spi1_sclk */
#define GPIO45_SPI1_SCLK \
	BFLB_PINMUX(45, spi1, sclk, periph)

/* gpio45_i2c2_sda */
#define GPIO45_I2C2_SDA \
	BFLB_PINMUX(45, i2c2, sda, periph)

/* gpio45_i2c3_sda */
#define GPIO45_I2C3_SDA \
	BFLB_PINMUX(45, i2c3, sda, periph)

/* gpio45_jtag_lp_tck */
#define GPIO45_JTAG_LP_TCK \
	BFLB_PINMUX(45, jtag_lp, tck, periph)

/* gpio45_jtag_m0_tck */
#define GPIO45_JTAG_M0_TCK \
	BFLB_PINMUX(45, jtag_m0, tck, periph)

/* gpio45_jtag_d0_tck */
#define GPIO45_JTAG_D0_TCK \
	BFLB_PINMUX(45, jtag_d0, tck, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL808CX_PINCTRL_H_ */
